<?php

/*

Задача 1

Существует массив, где каждый элемент - ассоциированный массив с ключами A, B, C. 
Необходимо получить массив, где в качестве ключей будет значение поля B, 
а в качестве значения - значение поля С

*/

/////////////////////////////////////////////////

// Решение 1 - Универсальное

$data = [
    ["A" => 1, "B" => "Хлеб", "C" => 50],
    ["A" => 2, "B" => "Молоко", "C" => 80],
    ["A" => 3, "B" => "Сыр", "C" => 250],
    // ["A" => 1, "B" => "Хлеб", "C" => 500],
];

$results = [];
foreach ($data as $item) {
    $results[$item["B"]] = $item["C"];
    // $results[$item["B"]][] = $item["C"]; // если нужно сохранить оба значения
}

echo '<pre>';
print_r($results);
echo '</pre>';

/////////////////////////////////////////////////

// Решение 2 - Лучшее, но для дубликатов не подойдет

$data = [
    ["A" => 1, "B" => "Петров", "C" => 85],
    ["A" => 2, "B" => "Смирнов", "C" => 92],
    ["A" => 3, "B" => "Иванов", "C" => 78],
    // ["A" => 4, "B" => "Петров", "C" => 95],
];

$results = array_column($data, 'C', 'B');

echo '<pre>';
print_r($results);
echo '</pre>';
